---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.MultipleLoopsInSketch
source: html/e347f2de-272c-9ae1-f008-94e3842dd53c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.MultipleLoopsInSketch Property

Sketch of <element> contains multiple independent loops - splitting it in few independent elements might improve performance.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultipleLoopsInSketch { get; }
```